---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopPath3d
source: html/c5a0708b-526a-c461-222e-bd18bc20e751.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.OpenLoopPath3d Property

Lines must be in closed loops. The highlighted lines are open on one end.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenLoopPath3d { get; }
```